# constants.py

# 坦克（Tank）英雄列表
TANK_HEROES = [
    "莱因哈特", "温斯顿", "路霸", "查莉娅", "D.Va", "末日铁拳", "奥丽莎",
    "破坏球", "渣客女王", "西格玛", "拉玛刹", "毛加", "骇灾"
]

# 输出（DPS）英雄列表
DPS_HEROES = [
    "死神", "猎空", "半藏", "托比昂", "法老之鹰", "黑百合", "堡垒", "秩序之光",
    "源氏", "卡西迪", "狂鼠", "士兵：76", "美", "黑影", "索杰恩", "艾什", "回声", "探奇"
]

# 辅助（Support）英雄列表
SUPPORT_HEROES = [
    "天使", "禅雅塔", "卢西奥", "安娜", "布丽吉塔", "莫伊拉",
    "巴蒂斯特", "雾子", "生命之梭", "伊拉锐", "朱诺"
]

# 地图列表
MAPS = [
    # 攻击/护送地图
    "暴雪世界", "国王大道", "中城", "努巴尼", "帕拉伊苏", "艾兴瓦尔德", "好莱坞",

    # 运载目标地图
    "多拉多", "哈瓦那", "渣客镇", "皇家赛道", "里阿尔托",
    "香巴里寺院", "监测站：直布罗陀", "66号公路",

    # 占领要点地图
    "南极半岛", "伊利奥斯", "漓江塔", "尼泊尔", "绿洲城", "釜山", "萨摩亚",

    # 机动推进地图
    "新皇后街", "斗兽场", "埃斯佩兰萨", "鲁纳塞彼",

    # 闪点作战地图
    "苏拉瓦萨", "新渣客城"
]

# 比赛状态
# team_1_advantage（队伍1优势）、team_2_advantage（队伍2优势）、balanced（平衡）
STATUS = ["team_1_advantage", "team_2_advantage", "balanced"]
